posts/algorithm-weekly-string-to-integer/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>每周算法：字符串转整数 | Hack Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">
<link href="/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://blog.wangzhl.com/posts/algorithm-weekly-string-to-integer/">
<link rel="icon" href="/favicon.ico" sizes="64x64">
<link rel="prev" href="/posts/map-reduce/" title="MapReduce模型" type="text/html">
<link rel="next" href="/posts/javascript-regexp-cheatsheet/" title="js正则表达式备忘" type="text/html">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="Hack Note">
<meta property="og:title" content="每周算法：字符串转整数">
<meta property="og:url" content="https://blog.wangzhl.com/posts/algorithm-weekly-string-to-integer/">
<meta property="og:description" content="Description


Implement atoi which converts a string to an integer.



The function first discards as many whitespace characters as necessary until the first non-whitespace character is found. Then, s">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-08-20T18:17:56+08:00">
<meta property="article:tag" content="algorithm">
<meta property="article:tag" content="leetcode">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/">Hack Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/">Home</a>
            <a class="page-link" href="/archive/">Archive</a>
            <a class="page-link" href="/tags/">Tags</a>
            <a class="page-link" href="/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post h-entry" itemscope="" itemtype="http://schema.org/BlogPosting"><header class="post-header"><h1 class="post-title p-name" itemprop="name headline">每周算法：字符串转整数</h1>

    <p class="post-meta">
      
    <time class="dt-published" datetime="2018-08-20T18:17:56+08:00" itemprop="datePublished">Aug 20, 2018</time></p>
  </header><div class="post-content e-content" itemprop="articleBody text">
    <div id="outline-container-orgc4477de" class="outline-2">
<h2 id="orgc4477de">Description</h2>
<div class="outline-text-2" id="text-orgc4477de">
<p>
Implement <code>atoi</code> which converts a string to an integer.<br></p>

<p>
The function first discards as many whitespace characters as necessary until the first non-whitespace character is found. Then, starting from this character, takes an optional initial plus or minus sign followed by as many numerical digits as possible, and interprets them as a numerical value.<br></p>

<p>
The string can contain additional characters after those that form the integral number, which are ignored and have no effect on the behavior of this function.<br></p>

<p>
If the first sequence of non-whitespace characters in str is not a valid integral number, or if no such sequence exists because either str is empty or it contains only whitespace characters, no conversion is performed.<br></p>

<p>
If no valid conversion could be performed, a zero value is returned.<br></p>

<p>
<b>Note:</b><br>
Only the space character ' ' is considered as whitespace character.<br>
Assume we are dealing with an environment which could only store integers within the 32-bit signed integer range: [−2<sup>31</sup>,  2<sup>31</sup> − 1]. If the numerical value is out of the range of representable values, <code>INT_MAX</code> (2<sup>31</sup> − 1) or <code>INT_MIN</code> (−2<sup>31</sup>) is returned.<br></p>

<p>
<b>Example 1:</b><br>
Input: "42"<br>
Output: 42<br></p>

<p>
<b>Example 2:</b><br>
Input: "   -42"<br>
Output: -42<br>
Explanation: The first non-whitespace character is '-', which is the minus sign.<br>
Then take as many numerical digits as possible, which gets 42.<br></p>

<p>
<b>Example 3:</b><br>
Input: "4193 with words"<br>
Output: 4193<br>
Explanation: Conversion stops at digit '3' as the next character is not a numerical digit.<br></p>

<p>
<b>Example 4:</b><br>
Input: "words and 987"<br>
Output: 0<br>
Explanation: The first non-whitespace character is 'w', which is not a numerical<br>
digit or a +/- sign. Therefore no valid conversion could be performed.<br></p>

<p>
<b>Example 5:</b><br>
Input: "-91283472332"<br>
Output: -2147483648<br>
Explanation: The number "-91283472332" is out of the range of a 32-bit signed integer.<br>
Thefore <code>INT_MIN</code> (−2<sup>31</sup>) is returned.<br></p>

<p>
来源 <a href="https://leetcode.com/problems/string-to-integer-atoi/description/">leetcode 8 string to integer</a><br></p>
</div>
</div>
