posts/algorithm-weekly-string-to-integer/index.org
*** Approach 1
这道题并不难，思路也比较容易想出来，下面就是我想到的解法。
可能需要注意的问题是：
1. 字符到数字的转换，这个涉及到ascii码表的记忆，如果记不住了可以直接使用'0' 'a' 'A'
2. 对于溢出的判断，我一开始只想到了使用 =int temp=num*10; if (temp/10!=num)= 进行判断，实际上却忽略了 =2147483648（0x80000000）= 的边界情况，这个是需要特别注意的。

#+BEGIN_SRC c++
int parseChar(char ch) {
    int num = ch - '0';
    if (num > 9 || num < 0) {
        return -1;
    }
    return num;
}

int myAtoi (string str) {
    bool isNegative = false;
    bool isOverflow = false;
    int num = 0;

    // 从前向后进行转换
    size_t pos = 0;

    // 去除多余的空格
    while (str[pos] == ' ') {
        ++pos;
    }

    // 首先判断是否有符号位
    if (str.length() > 0) {
        if (str[pos] == '-') {
            isNegative = true;
            ++pos;
        }
        else if (str[pos] == '+') {
            ++pos;
        }
    }

    // 是否以数字进行开头
    // 从左向右读取数字，每次读取需要判断是否溢出
    for ( ; pos < str.length(); ++pos) {
        int digit = parseChar(str[pos]);
        if (digit < 0) {
            // 负数说明该位不是数字了
            break;
        }

        // 如何判断是否溢出
        int temp = num*10;
        if (temp/10 != num) {
            isOverflow = true;
            break;
        }

        num = temp + digit;
    }

    // 如果num变成负数，也是溢出了，相当于对最后一位检查溢出
    if (isOverflow || num < 0) {
        return isNegative ? INT_MIN : INT_MAX;
    }

    return isNegative ? -num : num;
}
#+END_SRC

