posts/algorithm-weekly-string-to-integer/index.org
*** Approach 2
下面这段代码目前是leetcode上运行速度最快的solution sample，仅仅耗时了4ms。作者使用了很多让程序跑得更快的方法，其中的技巧值得我学习。
#+BEGIN_SRC c++
static int fast = []() {
  	ios_base::sync_with_stdio(0);
    cin.tie(0);
    cout.tie(0);
    return 0;
}();

class Solution {
public:
int myAtoi(string str) {
        long long sum = 0;
        int base=10;
        int n = str.size();
        bool flag = true;
        int sign = 1;
        for(int i = 0; i < n; i++) {
            if(isalpha(str[i])) {
                return sum;
            }
            else if(str[i]==' '&&flag) {
                continue;
            }
            else if(str[i]>='0' && str[i]<='9') {
                sum = 10*sum + sign*(str[i] - '0');
                flag = false;
            }
            else if(str[i] == '-' &&flag) {
                sign = -1;
                flag = false;
            }
            else if(str[i] == '+' && flag) {
                flag = false;
            }
            else {
                return sum;
            }

            if(sum > INT_MAX) {
                return INT_MAX;
            }
            else if(sum < INT_MIN) {
                return INT_MIN;
            }
            return sum;
        }
    };
#+END_SRC

- C++标准库中提供了判断是否是数字的接口 =isdigit= 和判断是否是字母的接口 =isalpha= 。

- 使用以下代码能加速代码的运行速度，这段代码会停止C++和C输入输出流的同步，并且解除 =cin= 和 =cout= 的捆绑，[[https://stackoverflow.com/questions/31162367/significance-of-ios-basesync-with-stdiofalse-cin-tienull][这里]] 有更详细的解释。效果很明显，将其添加到我的代码中，将我的代码的运行时间从20ms提升至8ms。
#+BEGIN_SRC cpp
static int fast = []() {
  ios_base::sync_with_stdio(0);
  cin.tie(0);
  cout.tie(0);
  return 0;
}();
#+END_SRC

